Repository: magi1125/inclusive-design-pattern
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: In text justification, to make each line of equal length, words need to be redistributed within their lines, creating distractingly uneven word spacing.
ja: テキストの均等割り付けを行うと、各行を同じ長さにするために、その行内で単語を再割り付けする必要があるため、単語間のスペースが不均一になって読みにくくなります。

source: In text that isn’t justified (see “Justification” below) this will vary, so you should measure the longest line of a sample paragraph.
ja: 均等割り付けされていないテキスト（下の「均等割り付け」を参照）では、これはバラバラになります。このため、サンプルパラグラフにおける最も長い行を測るようにします。

source: In the CSS font stack, characters not supported by a priority font are filled by a fallback.
ja: CSSのフォントスタックの仕組みでは、最優先フォントでサポートされていない文字はフォールバックによって補われます。

source: In the W3C’s WCAG 2.0 accessibility guideline 1.4.8 Visual Presentation10, it is recommended that a generous “space-and-a-half” of leading is applied to paragraphs.
ja: W3CのWCAG 2.0アクセシビリティガイドライン1.4.8「視覚的提示」（脚注24）では、パラグラフに「1.5文字分」の行送りを適用することを推奨しています。

source: In the article “A Typeface For Dyslexics?
ja: Lucidaフォントの作成者であるチャック・ビゲロウ（Chuck Bigelow）は、ブログ記事「A Typeface For Dyslexics?

source: In the context of surrounding paragraph text, it is no doubt possible to infer what the heading is referring to.
ja: 前後の段落の文脈を見れば、見出しが何を指しているか推測することは間違いなく可能でしょう。

source: In the example above, 100% is equal to 16px if the user has not adjusted the font size manually, either in their operating system or browser settings (e.g. under Preferences → Content in Firefox).
ja: この例の場合、もしユーザーがオペレーティングシステムやブラウザの設定（たとえばFirefoxの場合は［オプション］→［コンテンツ］）でフォントサイズを手動で調整していないなら、100%は16pxになります。

source: In the example below, the line-height and margin of the p will scale proportionately, because they are both set relative to the font-size.
ja: たとえば次の例では、pのline-heightとmarginはfont-sizeに相対的に設定されているため、両者のサイズのバランスは維持されます。

source: In the first set they are not a mirror image.
ja: 1つめのセットは鏡文字ではない。

source: In the first, commented out example, someone navigating by heading using the generic h key would be unaware of the publish date because the screen reader would take them silently past it.
ja: ひとつ目の例では、汎用的なhキーを使用して見出しでナビゲートしている人には公開日付はわかりません。スクリーンリーダーは日付を読み上げずに通過してしまうからです。

source: In the loading process, first you get HTML and with it content.
ja: 読み込みのプロセスにおいて、まずHTMLとそのコンテンツを取得する。

source: In this implementation, a linear-gradient background with a height of just 0.05em forms the underline.
ja: この実装では、高さがわずか0.05emのlinear-gradientの背景がアンダーラインを形成しています。

source: In which case, the following solution could work:
ja: そのような場合には、以下の方法で対処できます。

source: In which case, we don’t want to ask editors to have to upload and link icon images or — worse still — edit the source to add a class attribute to each external link.
ja: その場合、編集者にアイコン画像をアップロードしてリンクするよう頼むのは避けたいですし、ましてや、ソースを編集して各外部リンクにclass属性を追加してもらうことなど頼めません。

source: In “A Paragraph” I offered some basic guidance on writing easily digestible body text.
ja: 3章「パラグラフ」では、わかりやすい本文の書き方について基本的なガイダンスを提供しました。

source: Inclusive design is about appreciating how people really use interfaces, not just fixing technical errors.
ja: インクルーシブデザインとは、単に技術的なエラーを修正するだけではなく、ユーザーが実際にインターフェイスをどのように使うかを評価することなのです。

source: Inclusive typesetting aids readability and is the task of choosing a measure, justification and leading which suit the typeface at hand.
ja: インクルーシブな組版は、読みやすさを向上します。これは、使用している書体に合ったカラム幅、均等割り付けの有無、行送りを選択する作業です。

source: Indicating Focus
ja: フォーカスを示す

source: Inline Links
ja: インラインリンク

source: Instead of relying on conventional wisdom, here are a few things to ask about a typeface under consideration:
ja: 検討中の書体については、従来からの知恵に頼るのではなく、以下について考える必要があります。

source: Instead, line-height should be set as a unitless proportion:
ja: 代わりに、line-heightに単位のない比率の値を設定しましょう。

source: Instead, by selecting a typeface which is workable for those who struggle to read, we arrive at a choice that works for everyone.
ja: そうではなく、読むことに困難を抱える人にも読みやすい書体を選ぶことで、すべての人が読みやすくなります。

source: Instead, we can use CSS pseudo-content to automatically add the icon based on the matched selector:
ja: 代わりに、CSSの疑似要素を使用して、セレクタにマッチしたものにアイコンを自動的に追加することができます。

source: Instead, you might deem the subtitle unimportant and want to remove its text from the outline altogether.
ja: そうではなく、サブタイトルは重要でないと考えて、アウトラインからそのテキストをまるごと削除したいこともあります。

source: Instead, you should create an entirely flexible design from the outset and insert breakpoints only where the content breaks the layout — hence content breakpoint or tweakpoint.
ja: それよりも、最初から完全に柔軟なデザインを作り、コンテンツのレイアウトが切り替わるところだけにブレイクポイントを挿入すべきです――すなわち、コンテンツブレイクポイント、あるいは微調整ポイントということになります。

source: Is the page still navigable and usable?
ja: ナビゲートでき、使い物になっていますか？

source: It also helps the user to write in the page’s language.
ja: また、ユーザーがページの言語で入力する際にも役立ちます。

source: It gives us the freedom to exercise our creativity, and it gives us the freedom to exercise our creativity.
ja: 創造力を働かせる自由をくれると同時に、創造力を働かせる自由をくれるのです。

source: It is advisable to slightly temper the contrast between your paragraph text and background color.
ja: パラグラフのテキストと背景の色のコントラストは、少し控えめにすることをおすすめします。

source: It is possible to switch languages within a page using the lang attribute on child elements within the <body>.
ja: <body>内の子要素にlang属性を指定して、1つのページの中で言語を切り替えることも可能です。

source: It is the top heading of the document.
ja: そのドキュメントの先頭の見出しです。

source: It is the vertical measure between one line’s baseline and the next.
ja: ある行のベースラインと次の行のベースラインとの距離に相当します。

source: It is true that a greater number of users will operate full-page zoom using Cmd (or Ctrl) and +, but modern browsers and operating systems still support text-only resizing, and so should you.
ja: Cmd（またはCtrl）キーと＋キーを同時に押してフルページズームするユーザーが増えているのは確かです。しかし、最近のブラウザやオペレーティングシステムもテキストのみのサイズ変更をサポートしているため、それに対応しておくべきでしょう。

source: It saves you a lot of manual coding without sacrificing accessibility.
ja: アクセシビリティを犠牲にすることなく、コードを書く手間を大幅に軽減できます。

source: It should describe the purpose of the contents of said element.
ja: アクセシブルな名前 (name) には、それら要素の内容と使用目的が書かれているべきです。

source: It should enable them to get on with what they’re good at without the fear of breaking anything.
ja: そうすれば、編集者は何かを壊すのではないかと恐れることなく、自分の得意とする作業を進めることができます。

source: It then becomes operable: you can follow the link by pressing Enter.
ja: これでそのリンクが操作可能になり、Enterを押せばリンクをたどることができます。

source: It would appear that the typeface designers, though well-meaning, made some generalizations about the target audience.
ja: 書体デザイナーが、良かれと思ってターゲットの読者を少し一般化しすぎたと考えられます。

source: It would be poorly placed here because we haven’t even begun the main content of the document (which is the outermost section).
ja: この例では、まだドキュメントのメインコンテンツ（最も外側のセクション）も開始していないため、ここに置くのは良くないでしょう。

source: It would be remiss of me to talk about inclusive paragraph design without mentioning how to actually write approachable, accessible content.
ja: アクセシブルでわかりやすいコンテンツを実際に書く方法に触れずに、インクルーシブなパラグラフデザインについて語ることは許されないでしょう。

source: It’s a common misconception that pseudo-content (in this case, “(external link)”) is not announced in screen readers19.
ja: 疑似コンテンツ（ここでは「(外部リンク)」）はスクリーンリーダーで読み上げられないというのは、よくある誤解です。（脚注33）

source: It’s a style implemented on the official UK government website, GOV.UK18; an exemplar of inclusive service design, with a responsibility to be usable by every British citizen.
ja: これは、イギリス政府の公式Webサイト、GOV.UK（脚注32）が実装しているスタイルです。イギリスの全国民に対して利用可能にするという責任を自覚した、インクルーシブなサービスデザインの模範と言えます。

source: It’s currently the easiest offline solution available, because it means the reader can print to PDF and save to their local drive.
ja: これは、Webをオフラインで読むための方法として、現在利用できる最も簡単なソリューションでもあります。読者は印刷結果をPDF出力して、ローカルディスクに保存することができるからです。

source: It’s difficult to overestimate the effect of simplicity on both performance and accessibility.
ja: パフォーマンスとアクセシビリティのどちらの点でも、簡素であることには計り知れないほどの効果があります。

source: It’s easy to include the lang attribute, so just go ahead and include it.
ja: lang属性を指定するのは簡単なことですので、ぜひ使ってみてください。

source: It’s for all these reasons that Tantek Çelik11, cofounder of the IndieWeb movement, believes JavaScript-dependent static content is not in keeping with web design fundamentals.
ja: こうした理由から、IndieWebムーブメントの創始者のひとりであるタンテック・チェリック（Tantek Çelik）（脚注46）は、JavaScript依存の静的コンテンツはWebデザインの原則に則っていないと主張しています。

source: It’s important to note that legible body text for folks with reading disorders such as dyslexia is also pleasant body text for those who have less trouble reading.
ja: ディスレクシアなどの読字障害を持つ人にとって読みやすいテキストは、読むのに問題がない人にとっても好ましいテキストです。このことに注目するのは重要です。

source: It’s not just about JavaScript or CSS being unavailable, but when and how they are unavailable, for how long, and when they should be made available, and in what order.
ja: 単にJavaScriptやCSSが使えないということだけでなく、どんなときに、どのように、どのくらいの時間使えないのか、そしていつ、どういう順序で利用できるようにするべきなのかが重要になります。

source: It’s rarely worth saying the same thing twice in different ways.
ja: たいていの場合、別の方法で同じことを二回言っても価値はありません。

source: It’s simple to then supply the font in your CSS, using the .fonts-loaded class selector shown above:
ja: あとは単純に、上記の.fonts-loadedクラスセレクタを使って、CSSで該当のフォントを指定するだけです。

source: It’s what ends up in the compiled CSS, parsable by browsers, that counts.
ja: 最終的にブラウザが解析するコンパイル後のCSSで、計算後の数値が使われるはめになります。

source: It’s what the user went to the page for, after all.
ja: コンテンツこそ、ユーザーがページにアクセスする目的なのですから。

source: It’s why we should also provide transcripts alongside video content.
ja: それこそが、ビデオコンテンツにトランスクリプト（内容を文字に書き起こしたもの）を添えるべき理由です。

source: I’d be the first to admit I was putting vanity before inclusion.
ja: 私自身が、インクルーシブより見た目の美しさを優先しようとしていたのです。

source: I’ll also cover effective link text, incorporating video content, and the creation of an automated flow system to ease the work of content editors.
ja: また、効果的なリンクテキスト、ビデオコンテンツの組み込み、コンテンツ編集者の作業を容易にする自動化されたフローシステムの作成についても説明します。

source: I’ll talk more about the terseness with which you can create responsive, self-managing grids1 using Flexbox in the “A Filter Widget” chapter.
ja: flexboxを使用して、 レスポンシブな自己管理型のグリッドを作る（脚注36）簡単な方法については、10章「フィルターウィジェット」で詳しく説明します。

source: I’m a big believer in content-first design20.
ja: 私は、コンテンツファーストデザイン（脚注34）の信者です。

source: I’m concerned we only usually look at HTML semantics in terms of discrete elements providing meaning, and not by looking at their relationships to one another.
ja: HTMLのセマンティクスは、意味を提供する個々の要素の観点だけで見られてしまいがちで、他の要素との関係は考慮されない傾向にあります。

source: I’m glad it’s not me who’ll have to inform your brand guru!
ja: ブランディングのリーダーに伝えるのが私の役割でなくてよかった！

source: I’m not one to print web pages.
ja: 私はWebページの印刷をしないタイプの人間です。

source: I’m not saying every website and app should look the same, but we have a habit of breaking with conventions just to appear radical.
ja: あらゆるWebサイトとアプリの見た目が同じでなくてはならないとは言いませんが、根本から生じる慣習を壊そうとするくせが私たちにはあります。

source: I’m not talking HTML or XHTML; I mean English or French.
ja: 言語といっても、HTMLかXHTMLかという話ではありません。英語かフランス語かという話です。

source: I’ve been stung too many times.
ja: それで何度も痛い目にあってきましたから。

source: I’ve had a blog for several years and it’s been through four to five design iterations.
ja: 私は数年間ブログを書いており、デザインの見直しを4、5回行いました。

source: I’ve seen many an implementation which chooses to put the subtitle in a separate heading element, like so:
ja: 以下のように、別の見出し要素にサブタイトルを入れている実装を多数見たことがあります。

source: Just install readability-checker globally and point it at a web page.
ja: readability-checkerをインストールして、Webページを指定するだけです。

source: Just press Cmd + Option + M, then resize the simulated viewport incrementally until the content is forced to collide, overlap or wrap.
ja: Cmd + Option + Mキーを押してみてください。すると、シミュレートされたビューポートが、コンテンツがぶつかったり、重なったり、折り返したりするところまで徐々にリサイズされていきます。

source: Justification
ja: 均等割り付け

source: Justification means making each line the same length, which makes paragraphs look neater but can severely impair readability.
ja: 均等割り付けとは、それぞれの行を同じ長さにすることを意味します。これによりパラグラフの見た目はすっきりしますが、読みやすさは大きく損なわれる可能性があります。

source: Justification, possible by setting text-align: justify; in your CSS, is generally considered bad practice for web content.
ja: CSSでtext-align:justify;を設定することで可能となる均等割り付けは、一般にWebコンテンツには推奨されない慣習です。

source: Keeping things prosaic for now, let’s look at paragraphs in context.
ja: まずは淡々と、パラグラフをコンテキストに照らして見ていきましょう。

source: Kerning (the spacing between characters) benefited from being reasonably generous, particularly between r and n.
ja: カーニング（文字間のスペース）は適度に空けた方が読みやすくなり、特にrとnの間隔については顕著です。

source: Layout and interaction can become error-prone and unpredictable.
ja: その場合、レイアウトやインタラクションが不安定になることがあります。

source: Leading (line-height)
ja: 行送り (line-height)

source: Leading relates to the height of individual lines.
ja: 行送りは、各行の高さを決めるものです。

source: Let’s start small.
ja: まずは小さなところから。

source: Like many designer-bloggers, I seem to be afflicted with obsessive tinkering and I’m still not happy with the result.
ja: 多くのデザイナーブロガーと同じように、あちこちいじらずにはいられず、今も結果には満足していません。

source: Like the <main> element, the exposes a navigation shortcut for assistive technology users.
ja: <main>要素と同じく、は、支援技術のユーザーにナビゲーション用のショートカットを提供します。

source: Lines that are too long are difficult to read because, on reaching the end of the line, scanning back to find the start of the following line becomes problematic.
ja: 行が長すぎると、行末まで読んだ後、次の行の行頭を探すのが大変になるため、読みにくくなります。

source: Lines that are too short require darting your eyes back and forth too frequently — something that becomes tiresome quickly.
ja: また、行が短すぎると、視線を頻繁に素早く往復させなくてはならなくなります――読む人はすぐに疲れてしまいます。

source: Links, like the <button> element addressed in the introduction, are implicitly focusable.
ja: リンクは、「はじめに」で触れた<button>要素と同様に、暗黙的にフォーカス可能です。

source: Locating content breakpoints is easy using Firefox’s responsive design mode3.
ja: コンテンツブレイクポイントを検討する際は、Firefoxの レスポンシブデザインモード（脚注6）が便利です。

source: Making an element keyboard-accessible is quite straightforward:
ja: キーボードで要素にアクセスできるようにするのは、非常に簡単です。

source: Managing Assets
ja: アセットの管理

source: Measure
ja: カラム幅

source: More on that shortly.
ja: これについては、この後、詳しく説明します。

source: Much maligned as the arduous task of making web applications still do things when a unicorn-rare user switches JavaScript off, it has much broader implications.
ja: JavaScriptをオフにしているユニコーンのように希少なユーザーでも使えるWebアプリケーションを作るかのような骨の折れる仕事だ、などと言われることが多いのですが、実際にはもっと広い意味があります。

source: My blog’s local domain is heydonworks.com, so I’d build a selector like this:
ja: 私のブログのドメインはheydonworks.comなので、セレクタを次のように組み立てます。

source: Never forget that the browser itself is an interface, which can be augmented and configured in a number of ways by the user — as well as helping interpret the content you provide for third-party assistive technologies like screen readers.
ja: ブラウザ自体もひとつのインターフェイスだということを忘れてはいけません。ユーザーはさまざまな方法で設定や拡張を行うことができます――コンテンツの解釈を助けるために、スクリーンリーダーのようなサードパーティの支援技術を導入することもあります。

source: Nevertheless, you should only include a subset containing the characters you need or your users may suffer performance issues.
ja: しかし、必要な文字のサブセットだけを含めるようにしないと、ユーザー側にパフォーマンスの問題が生じかねません。

source: No harm done.
ja: 害もありません。

source: None of our users is like the average user.
ja: 平均的ユーザーのようなユーザーなど存在しません。

source: Nonetheless, it is entirely possible to design an excruciatingly unreadable font which is technically sans serif.
ja: とはいえ、形式上はサンセリフであっても、耐えがたいほど読みにくいフォントをデザインすることも十分可能です。

source: Nonetheless, there are some general guidelines that are applicable to paragraph text:
ja: とは言え、パラグラフテキストに適用できる汎用的なガイドラインがいくつかあります。

source: Not all browsers even support hyphenation for languages other than English.
ja: ブラウザの中には、英語以外の言語でのハイフネーションをサポートしていないものもあります。

source: Not all screen reader and browser combinations support pseudo-content, but most do.
ja: 全てのスクリーンリーダーとブラウザの組み合わせが疑似コンテンツをサポートしているわけではありませんが、ほとんどはサポートしています。

source: Not incorporating complex and ambitious layouts also puts you on the path to a more robust, flexible reading experience.
ja: 複雑で凝ったレイアウトを作り込まないことも、より堅牢で柔軟な閲覧体験につながります。

source: Not only are there discrete technical shortcomings (such as certain devices suppressing the zoom of <option> overlays), but they just don’t seem to be understood by all sorts of people.
ja: 個々の技術的な欠点（特定のデバイスで、オーバーレイ表示される<option>をズームできないなど）があるだけではなく、あらゆる人に理解できるわけではないようです。

source: Not only does capitalizing on this convention help folks to identify links within paragraph text, but it also alleviates a more extreme concern of inclusive design: color blindness.
ja: この慣習を取り入れることで、パラグラフテキスト内のリンクが見分けやすくなるだけでなく、インクルーシブデザインで重視すべき色覚異常の問題も軽減されます。

source: Not only does it make the page more indexable by search engines, but it also becomes easier to translate by users operating third-party tools such as Google’s Translate API2.
ja: 検索エンジンによるインデックス付けがやりやすくなるほか、ユーザーがGoogleのTranslate API（脚注5）のようなサードパーティツールを使って翻訳することも容易になります。

source: Not only does this produce a larger document to download, but also it can have additional, unpleasant side effects.
ja: ダウンロードするドキュメントが大きくなるだけでなく、やっかいな副作用が発生することもあります。

source: Not to worry: font-size: calc(1em + 1vw); is a progressive enhancement.
ja: ご心配なく。font-size: calc(1em+1vw); という記述はプログレッシブエンハンスメントになっています。

source: Note that the first structure is unlikely to produce an error in an automated accessibility testing tool.
ja: なお、上記の最初のコード例の構造は、自動化されたアクセシビリティテストツールでは、おそらくエラーとはなりません。

source: Note that unlike text-decoration: underline;, this underline is adjustable.
ja: text-decoration: underline;とは異なり、このアンダーラインは調整可能です。

source: Note the id below, which allows keyboard users to navigate to the article via a skip link (also discussed in “The Document”):
ja: 下のidに注意してください。これにより、キーボードユーザーがスキップリンクを介して記事に移動できるようになります（詳しくは2章で説明しています）。

source: Note the use of relative units and a percentage-based background-size to make sure the icon scales with the text when it is resized by the user or in a media query.
ja: ユーザーによって、またはメディアクエリでテキストのサイズが変更されたときに、これに合わせてアイコンのサイズが変更されるよう、相対的な単位によるwidthとheight、およびパーセンテージに基づくbackground-sizeが使用されていることに注目してください。

source: Note the use of the <span> with the .visually-hidden class.
ja: .visually-hiddenクラスを指定した<span>を使っていることに注目してください。

source: Note, however, that readability is rather subjective.
ja: ただし、この読みやすさはかなり主観的であることに注意してください。

source: Notes
ja: 補足

source: Now that we’re putting a few paragraphs together within a blog article, it’s probably a good time to review the readability of your content.
ja: ブログ記事内にいくつかのパラグラフをまとめつつあるので、コンテンツの読みやすさを見直すには良いタイミングでしょう。

source: Now that you’re familiar with the structural contribution of headings, you should be able to see the problem: the creates an immediate subsection, “In Seven Easy Steps.” That’s a pretty weird, fragmentary heading for a section and would make little sense wherever a table of contents is generated:
ja: ここまでに見出しの構造的な役割を学習してきた皆さんには、何が問題かおわかりでしょう。それは、がすぐ下に「～シンプルな7つのステップで～」というサブセクションを作るということです。これはセクションの見出しとしては奇妙で断片的であり、以下のような、ほとんど意味を成さない目次ができることになります。

source: Now, as the paragraph font size is increased or decreased (either in a media query or by the user changing their font size settings), a comfortable, proportionate line height is ensured.
ja: これで、パラグラフのフォントサイズが大きくなったり小さくなったりしても（メディアクエリによる変更の場合、ユーザーがフォントサイズの設定を変更した場合のいずれであっても）、読みやすくバランスのとれた行の高さになります。

source: OK, let’s see how our inclusive document is shaping up.
ja: それでは、ここまで見てきたインクルーシブなドキュメントがどのような構成になったか見てみましょう。

source: Occasionally, you’ll still want to put somethings next to some other things, if only to be intensive with the available space.
ja: 時には、空きスペースを徹底的に埋めるために、ものを横並びにしたいと思うことがあるでしょう。

source: On slow networks, the content should arrive as soon as possible.
ja: ネットワークの速度が遅い場合は、コンテンツができるだけ早く表示されるようにしなければなりません。

source: One approach to inclusive interaction design is to look at interfaces from the perspective of human interface devices (HIDs): different devices which allow input from and/or output to a human user.
ja: インクルーシブなインタラクションデザインへのアプローチのひとつに、ヒューマンインターフェイスデバイス（HID）の視点からインターフェイスを見るという方法があります。HIDとは、人間のユーザーが入出力を行えるさまざまな機器のことです。

source: One hundred points is what we’re aiming for here.
ja: 目指すは100点です。

source: One of the most popular browsers, Chrome, does not support hyphenation at all.
ja: 最も普及しているブラウザのひとつであるChromeは、ハイフネーションをまったくサポートしていません。

source: One well-supported claim is that sans serif fonts are more readable than serif ones.
ja: よく支持されている意見のひとつは、セリフ書体よりサンセリフ書体の方が読みやすいというものです。

source: Other times they do have an impact but the part they play is confusing, inconsistent or obstructive.
ja: また、効果が間違いなく発揮される場合でも、混乱を招いたり、一貫性がなかったり、じゃまだったりする場合もあります。

source: Others will contribute to the modular, often dynamic content that makes up unique pages.
ja: そうではなく、ユニークなページを構成するコンテンツや、動的なコンテンツなどもあります。

source: Otherwise “modern” could be read as “modem.”
ja: 間隔が狭すぎると「modern」は「modem」と読めてしまいます。

source: Part of inclusion is achieving a parity of experience across different user needs.
ja: インクルージョンの役割のひとつは、多様なユーザーニーズ全体を通して、体験を等価なものにすることです。

source: Patterns in this book are founded on well-formed and semantic HTML structures, enhanced by CSS and JavaScript.
ja: 本書で紹介するパターンは、整形式のセマンティックHTMLの構造をベースにし、CSSとJavaScriptでエンハンスメントしたものです。

source: Perhaps most starkly, a page that does not have a language declared — or has the wrong language declared for the content — will not trigger the adoption of an appropriate synthetic voice profile when used with a screen reader.
ja: おそらく最もわかりやすいのは、言語が明示されていないページ――あるいは間違った言語が指定されているページ――では、スクリーンリーダーを使用したときに適切な合成音声プロファイルが選択されないことです。

source: Plain English.
ja: プレイン・イングリッシュ。

source: Practically speaking, the <main> and offer similar functionality, so why employ both?
ja: 実質的に、<main>と は似たような機能を提供していますが、両方を採用するのはなぜでしょうか？

source: Progressive Enhancement
ja: プログレッシブエンハンスメント

source: Progressive Enhancement And Interoperability
ja: プログレッシブエンハンスメントと相互運用性

source: Progressive enhancement is about building a strong foundation of content, logical and robust in form, which is resilient to a multitude of network and scripting failures.
ja: プログレッシブエンハンスメントの目的は、さまざまな回線状況やスクリプト処理の失敗にも対応できるコンテンツの強固な基盤を、合理的かつ堅牢な形で構築することです。

source: Progressive enhancement, like responsive design, is a cornerstone of inclusive design.
ja: レスポンシブデザインと同じく、インクルーシブデザインの土台となるのがプログレッシブエンハンスメントです。

source: Providing server-rendered content also means that content will be found by folks using search engines, and is parsable by third parties using command line tools like cURL10.
ja: また、サーバーでレンダリングされたコンテンツを提供することは、検索エンジンのユーザーがそのコンテンツを見つけられること、第三者がcURL（脚注45）などのコマンドラインツールから利用できることを意味します。

source: Providing the Icon
ja: アイコンの提供

source: Providing unobtrusive options for users is sometimes called multimodality.
ja: ユーザーに目立たない複数のオプションを提供することを、マルチモダリティと呼ぶことがあります。

source: Putting The Page Together
ja: ページを見てみよう

source: Quite apart from it causing readability issues, it just looks feeble.
ja: 読みやすさに問題が生じることはさておき、弱々しく見えます。

source: Recently, products like Tenon17 have begun to emerge: quality assurance tools focused on accessibility and inclusion.
ja: 最近、アクセシビリティとインクルージョンにフォーカスした製品としてTenon（脚注50）のような品質保証ツールが登場しはじめました。

source: Responsive Design
ja: レスポンシブデザイン

source: Responsive design is a big part of inclusive design.
ja: レスポンシブデザインはインクルーシブデザインの重要な要素のひとつです。

source: Running VoiceOver you can open the rotor (Ctrl + Option + U on Mac OS X) and see headings listed in a similar fashion.
ja: VoiceOverでは、ローター（Mac OS X上でCtrl + Option + U）を開いて、同じようにリストされた見出しを見ることができます。

source: Save for button-like call-to-action links which play by different rules of affordance, it is conventional for links to be underlined.
ja: 異なるアフォーダンスのルールで動作する、ボタンのようなコールトゥアクションリンクを除き、リンクにはアンダーラインを付加するのが慣習です。

source: School Level
ja: 学年

source: Scientific though a formula for determining readability may sound, you cannot rely on Flesch-Kinkaid tests alone.
ja: 読みやすさを判定する公式は科学的に見えるかもしれませんが、Flesch-Kinkaidテストだけに頼るべきではありません。

source: Score
ja: 得点

source: Screen readers like JAWS also offer a keyboard shortcut (the Q key) to access <main>, allowing the user to bypass a page’s preamble and go straight to the content they came for.
ja: JAWSなどのスクリーンリーダーには、<main>にアクセスするキーボードショートカット（Qキー）も用意されているため、ユーザーはページの前置きを飛ばして目的のコンテンツに直行できます。

source: Semantic structure and source order must be taken into account.
ja: セマンティックな構造とソースの順序を考慮に入れなければなりません。
